target/appassembler/bin/output/ws-batch-executor-errorLog-20150511_142239.log

> 11/05/2015 14:22:39 main INFO  batchExecutorLogErrorFile - Registros processados com erro:
--------------------------------------------------------------------------------
> 11/05/2015 14:22:42 main ERROR batchExecutorLogErrorFile - Erro ao executar o request na linha [5] do arquivo de entrada.
Erro: returnCode diferente de 0
Request Executado: 
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">                                                                                                       <Header/>                                                                                                                                                                       <Body>                                                                                                                                                                          <ebo:QueryInstalledProductListEBM xmlns:ebo="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/InstalledProduct/V2">                                                        <corecom:EBMHeader xmlns:corecom="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2"/>                                                                             <ebo:DataArea>                                                                                                                                                            <ebo:Query>                                                                                                                                                            <corecom:QueryCriteria xmlns:corecom="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2">                                                                    <corecom:QueryExpression>                                                                                                                                        <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/InstalledProductCustomer/CustomerPartyReference/CustomerPartyAccountIdentification/ID</corecom:ElementPath>       <!--ID da conta do cliente-->                                                                                                                              <corecom:Value>1107173010</corecom:Value>                                                                                                                  </corecom:ValueExpression>                                                                                                                                    <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/Custom/Category</corecom:ElementPath>                                                                             <!--Texto fixo para buscar itens de categoria equipamento-->                                                                                               <corecom:Value>Venda</corecom:Value>                                                                                                     </corecom:ValueExpression>                                                                                                                                    <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/ProcessingStatus/Code</corecom:ElementPath>                                                                       <!--Texto fixo para buscar apenas itens ativos-->                                                                                                          <corecom:Value>Cancelled</corecom:Value>                                                                                                              </corecom:ValueExpression>                                                                                                                                    </corecom:QueryExpression>                                                                                                                                       </corecom:QueryCriteria>                                                                                                                                            </ebo:Query>                                                                                                                                                           </ebo:DataArea>                                                                                                                                                           </ebo:QueryInstalledProductListEBM>                                                                                                                                          </Body>                                                                                                                                                                         </Envelope>                                                                                                                                                                        

Response retornado: 
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/><SOAP-ENV:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><v2:QueryInstalledProductListResponseEBM xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/InstalledProduct/V2"><v21:EBMHeader xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2"><v21:Custom><arc:ResponseHeader xmlns:arc="http://www.sky.com.br/ArchitectureSchemas"><arc:returnCode>SOA-5001</arc:returnCode><arc:returnMessage>Nenhum registro encontrado para o critério de busca utilizado no serviço  QueryInstalledProductListSiebelProvABCSImplPS.</arc:returnMessage></arc:ResponseHeader></v21:Custom></v21:EBMHeader><v2:DataArea><v2:Query/><v2:QueryInstalledProductListResponse/></v2:DataArea></v2:QueryInstalledProductListResponseEBM></SOAP-ENV:Body></soapenv:Envelope>
--------------------------------------------------------------------------------
> 11/05/2015 14:22:44 main ERROR batchExecutorLogErrorFile - Erro ao executar o request na linha [11] do arquivo de entrada.
Erro: returnCode diferente de 0
Request Executado: 
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">                                                                                                       <Header/>                                                                                                                                                                       <Body>                                                                                                                                                                          <ebo:QueryInstalledProductListEBM xmlns:ebo="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/InstalledProduct/V2">                                                        <corecom:EBMHeader xmlns:corecom="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2"/>                                                                             <ebo:DataArea>                                                                                                                                                            <ebo:Query>                                                                                                                                                            <corecom:QueryCriteria xmlns:corecom="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2">                                                                    <corecom:QueryExpression>                                                                                                                                        <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/InstalledProductCustomer/CustomerPartyReference/CustomerPartyAccountIdentification/ID</corecom:ElementPath>       <!--ID da conta do cliente-->                                                                                                                              <corecom:Value>1107173010</corecom:Value>                                                                                                                  </corecom:ValueExpression>                                                                                                                                    <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/Custom/Category</corecom:ElementPath>                                                                             <!--Texto fixo para buscar itens de categoria equipamento-->                                                                                               <corecom:Value>Aluguel</corecom:Value>                                                                                                     </corecom:ValueExpression>                                                                                                                                    <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/ProcessingStatus/Code</corecom:ElementPath>                                                                       <!--Texto fixo para buscar apenas itens ativos-->                                                                                                          <corecom:Value>New</corecom:Value>                                                                                                              </corecom:ValueExpression>                                                                                                                                    </corecom:QueryExpression>                                                                                                                                       </corecom:QueryCriteria>                                                                                                                                            </ebo:Query>                                                                                                                                                           </ebo:DataArea>                                                                                                                                                           </ebo:QueryInstalledProductListEBM>                                                                                                                                          </Body>                                                                                                                                                                         </Envelope>                                                                                                                                                                        

Response retornado: 
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/><SOAP-ENV:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><v2:QueryInstalledProductListResponseEBM xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/InstalledProduct/V2"><v21:EBMHeader xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2"><v21:Custom><arc:ResponseHeader xmlns:arc="http://www.sky.com.br/ArchitectureSchemas"><arc:returnCode>SOA-5001</arc:returnCode><arc:returnMessage>Nenhum registro encontrado para o critério de busca utilizado no serviço  QueryInstalledProductListSiebelProvABCSImplPS.</arc:returnMessage></arc:ResponseHeader></v21:Custom></v21:EBMHeader><v2:DataArea><v2:Query/><v2:QueryInstalledProductListResponse/></v2:DataArea></v2:QueryInstalledProductListResponseEBM></SOAP-ENV:Body></soapenv:Envelope>
--------------------------------------------------------------------------------
> 11/05/2015 14:22:50 main ERROR batchExecutorLogErrorFile - Erro ao executar o request na linha [23] do arquivo de entrada.
Erro: returnCode diferente de 0
Request Executado: 
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">                                                                                                       <Header/>                                                                                                                                                                       <Body>                                                                                                                                                                          <ebo:QueryInstalledProductListEBM xmlns:ebo="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/InstalledProduct/V2">                                                        <corecom:EBMHeader xmlns:corecom="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2"/>                                                                             <ebo:DataArea>                                                                                                                                                            <ebo:Query>                                                                                                                                                            <corecom:QueryCriteria xmlns:corecom="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2">                                                                    <corecom:QueryExpression>                                                                                                                                        <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/InstalledProductCustomer/CustomerPartyReference/CustomerPartyAccountIdentification/ID</corecom:ElementPath>       <!--ID da conta do cliente-->                                                                                                                              <corecom:Value>1107173012</corecom:Value>                                                                                                                  </corecom:ValueExpression>                                                                                                                                    <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/Custom/Category</corecom:ElementPath>                                                                             <!--Texto fixo para buscar itens de categoria equipamento-->                                                                                               <corecom:Value>Objeto</corecom:Value>                                                                                                     </corecom:ValueExpression>                                                                                                                                    <corecom:ValueExpression>                                                                                                                                     <corecom:ElementPath>InstalledProductEBO/ProcessingStatus/Code</corecom:ElementPath>                                                                       <!--Texto fixo para buscar apenas itens ativos-->                                                                                                          <corecom:Value>Active</corecom:Value>                                                                                                              </corecom:ValueExpression>                                                                                                                                    </corecom:QueryExpression>                                                                                                                                       </corecom:QueryCriteria>                                                                                                                                            </ebo:Query>                                                                                                                                                           </ebo:DataArea>                                                                                                                                                           </ebo:QueryInstalledProductListEBM>                                                                                                                                          </Body>                                                                                                                                                                         </Envelope>                                                                                                                                                                        

Response retornado: 
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/><SOAP-ENV:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><v2:QueryInstalledProductListResponseEBM xmlns:v2="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/InstalledProduct/V2"><v21:EBMHeader xmlns:v21="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2"><v21:Custom><arc:ResponseHeader xmlns:arc="http://www.sky.com.br/ArchitectureSchemas"><arc:returnCode>SOA-5001</arc:returnCode><arc:returnMessage>Nenhum registro encontrado para o critério de busca utilizado no serviço  QueryInstalledProductListSiebelProvABCSImplPS.</arc:returnMessage></arc:ResponseHeader></v21:Custom></v21:EBMHeader><v2:DataArea><v2:Query/><v2:QueryInstalledProductListResponse/></v2:DataArea></v2:QueryInstalledProductListResponseEBM></SOAP-ENV:Body></soapenv:Envelope>
--------------------------------------------------------------------------------
